## Part 1: Wrangling

Using SQL compute a relation containing the total payroll and winning percentage (number of wins / number of games * 100) for each team (that is, for each teamID and yearID combination). You should include other columns that will help when performing EDA later on (e.g., franchise ids, number of wins, number of games).

In [3]:
import sqlite3
import pandas

sqlite_file = 'lahman2014.sqlite'
conn = sqlite3.connect(sqlite_file)

In [20]:
salary_query = """SELECT yearID, teamID, sum(salary) as total_payroll
                    FROM Salaries
                    GROUP BY yearID, teamID
"""

team_salaries = pandas.read_sql(salary_query, conn)

In [21]:
team_salaries

     yearID teamID  total_payroll
0      1985    ATL     14807000.0
1      1985    BAL     11560712.0
2      1985    BOS     10897560.0
3      1985    CAL     14427894.0
4      1985    CHA      9846178.0
..      ...    ...            ...
855    2014    SLN    120693000.0
856    2014    TBA     72689100.0
857    2014    TEX    112255059.0
858    2014    TOR    109920100.0
859    2014    WAS    131983680.0

[860 rows x 3 columns]

In [16]:
teams_query = """SELECT yearID, teamID, W as Wins, G as Games
                    FROM Teams 
                    GROUP BY yearID, teamID"""

team_wins = pandas.read_sql(teams_query, conn)

In [17]:
team_wins

      yearID teamID  Wins  Games
0       1871    BS1    20     31
1       1871    CH1    19     28
2       1871    CL1    10     29
3       1871    FW1     7     19
4       1871    NY2    16     33
...      ...    ...   ...    ...
2770    2014    SLN    90    162
2771    2014    TBA    77    162
2772    2014    TEX    67    162
2773    2014    TOR    83    162
2774    2014    WAS    96    162

[2775 rows x 4 columns]

In [27]:
q1_df = pandas.merge(team_salaries, team_wins, how='left', on=['yearID', 'teamID'])
q1_df["Winning Percentage"] = q1_df["Wins"] / q1_df["Games"] *100
q1_df.drop(["Wins", "Games"], axis=1, inplace=True)

In [33]:
q1_df

     yearID teamID  total_payroll  Winning Percentage
0      1985    ATL     14807000.0           40.740741
1      1985    BAL     11560712.0           51.552795
2      1985    BOS     10897560.0           49.693252
3      1985    CAL     14427894.0           55.555556
4      1985    CHA      9846178.0           52.147239
..      ...    ...            ...                 ...
855    2014    SLN    120693000.0           55.555556
856    2014    TBA     72689100.0           47.530864
857    2014    TEX    112255059.0           41.358025
858    2014    TOR    109920100.0           51.234568
859    2014    WAS    131983680.0           59.259259

[860 rows x 4 columns]

## Part 2: Exploratory Data Analysis

### Payroll Distribution

#### Problem 2 (8 pts)

Write code to produce plots that illustrate the distribution of payrolls across teams conditioned on time (from 1990-2014).

#### Question 1 (9 pts)

What statements can you make about the distribution of payrolls conditioned on time based on these plots? Remember you can make statements in terms of central tendency, spread, etc.